[
  {
    "id": 1,
    "title": "DIATADMIN — FULL-STACK ADMINISTRATIVE PLATFORM",
    "role": "Full Lifecycle Ownership",
    "description": "Owned end-to-end design and delivery of a custom administrative system for DIAT, a multi-branch technical institute. Collaborated directly with stakeholders to understand complex workflows, made architectural decisions balancing scalability and maintainability, and delivered modules spanning student admissions, academic management, fee tracking, and inventory. Managed full deployment lifecycle on VPS with Nginx, PM2, automated backups, and domain configuration.",
    "link": "",
    "problem_statement": "DIAT required a unified administrative system to manage academic, financial, and operational workflows across multiple branches, replacing fragmented manual processes and disconnected tools.",
    "architecture_image": "diat/DIATADMIN-FLOW-ARCHITECTURE.svg",
    "design_decisions": [
      "Implemented branch-level multi-tenancy with role-based access control to isolate data while sharing a single deployment",
      "Designed modular backend services to support independent scaling of academic, finance, and inventory domains",
      "Used cron-based automated backups to cost-effective object storage to avoid per-tenant infrastructure overhead",
      "Centralized authentication and permissions to simplify user management across branches",
      "Deployed on a VPS with Nginx and PM2 for controlled cost, predictable performance, and easier maintenance"
    ],
    "impact_metrics": [
      "Used daily by administrators across 4 branches",
      "Replaced multiple manual and spreadsheet-driven workflows with a single system",
      "Reduced operational overhead by avoiding separate deployments per branch"
    ]
  },
  {
    "id": 2,
    "title": "CONFIG-DRIVEN FRONTEND FRAMEWORK — INTERNAL UI PLATFORM",
    "role": "Framework Architect & Ownership",
    "description": "Architected and owned an internal config-driven frontend framework at Frugal Scientific, built on React (Vite), Material UI, Redux Toolkit, and Redux-Saga. The framework enables teams to generate complete enterprise admin interfaces—tables, forms, filters, drawers, permissions, and CRUD workflows—entirely from declarative configuration. Designed for high reuse, controlled extensibility, and long-term maintainability, the system is now the company-wide standard powering multiple production products.",
    "link": "",
    "problem_statement": "Across logistics and master-data products, admin interfaces followed nearly identical patterns but were implemented repeatedly with custom React components and Redux logic. This resulted in large-scale code duplication, inconsistent UX behavior, slow feature delivery, and high maintenance cost when requirements changed.",
    "architecture_image": "config-framework/CONFIG-DRIVEN-UI-FRAME-WORK-FLOW-ARCHITECTURE.svg",
    "design_decisions": [
      "Adopted a declarative, config-first approach to define admin modules instead of duplicating React code",
      "Built a single orchestrator component that renders tables, drawers, and forms dynamically from menu configuration",
      "Standardized async behavior using Redux-Saga to centrally handle API orchestration, filters, sorting, and pagination",
      "Implemented a multi-keyed Redux state architecture to isolate data, loading state, and caching per admin module",
      "Designed a flexible field-rendering system supporting complex data types, nested objects, and custom render overrides",
      "Introduced controlled escape hatches via a Form Registry, allowing injection of custom React forms when configuration alone is insufficient"
    ],
    "impact_metrics": [
      "Adopted as the standard frontend admin framework across 5+ production projects",
      "Used daily by co-developers across multiple teams",
      "Powers 100+ admin screens generated primarily from configuration",
      "Reduced time to build a new menu ui section from 2–3 days to ~1 hour",
      "Reduced frontend codebase size by ~50% by eliminating duplicated admin logic",
      "Eliminated the equivalent of hundreds of thousands of lines of redundant UI code across products"
    ],
    "technical_highlights": [
      "Built with React + Vite for fast builds and modern development workflow",
      "Material UI used as the base design system with framework-level consistency",
      "Redux-Saga used for complex async flows including dynamic filter query construction",
      "Supports role-based permissions, base filters, default sorting, and API module routing via config",
      "Configuration supports nested object mapping, constant value injection, computed fields, and custom cell renderers",
      "Custom React form components can be injected per module when advanced validation or workflows are required"
    ]
  },
  {
    "id": 3,
    "title": "SAAS ODR SESSION PLATFORM — REAL-TIME EVENT SYSTEMS",
    "role": "Real-Time Architecture & Event Orchestration",
    "description": "Designed and built a SaaS ODR session and event management platform at Frugal Scientific to support scheduled online arbitration and mediation workflows. Enabled arbitrators to create events, invite participants via email and SMS, and conduct structured virtual proceedings through a public FIFO-based lobby with turn-controlled access and chat. Implemented mobile OTP-based authentication with unique invite tokens for frictionless public access, real-time state synchronization using WebSockets, and resilient rejoin handling that places disconnected participants back into the lobby queue. Automated session notifications, reminders, and lifecycle management using cron-based background jobs, balancing real-time responsiveness with system reliability.",
    "link": "",
    "problem_statement": "Arbitrators and mediators were manually coordinating scheduled online arbitration and mediation sessions using external video links and ad-hoc communication, resulting in poor access control, lack of structured turn management, and high operational overhead.",
    "architecture_image": "odr-session-management/ODR-EVENT-SESSION-MANAGEMENT-SYSTEM-FLOW-ARCHITUCTURE.svg",
    "design_decisions": [
      "Designed a public FIFO-based lobby to manage participant sequencing and fairness",
      "Implemented turn-controlled access to enforce structured arbitration and mediation flow",
      "Used WebSockets for real-time state synchronization across lobby, turns, and chat",
      "Implemented mobile OTP authentication with unique invite tokens for low-friction public access",
      "Handled session lifecycle, drop/rejoin scenarios, and participant re-queuing for reliability",
      "Used cron-based background jobs for automated invites, reminders, and session lifecycle events"
    ],
    "impact_metrics": [
      "Supported scheduled online arbitration and mediation events with up to ~50 participants per session",
      "Enabled multiple concurrent ODR events with controlled access and session flow",
      "Eliminated manual coordination of virtual dispute resolution sessions",
      "Improved reliability and structure of remote arbitration and mediation workflows"
    ]
  },
  {
    "id": 4,
    "title": "FINTECH FIELD OPERATIONS & REPORTING DASHBOARD — PRODUCT OWNERSHIP",
    "role": "Frontend Architecture & Product Ownership",
    "description": "Owned and developed the complete frontend architecture and UI/UX of a fintech field-operations and reporting platform for a loan recovery company. Built role-hierarchy–based dashboards used by regional heads, state heads, managers, and operations teams to track collections, visits, attendance, and performance. Implemented real-time field activity monitoring for collection agents, combining live location tracking, visit timelines, and map-based operational visibility. Integrated multiple external services including Frappe APIs, Google Maps, and OpenStreetMap to support real-time data visualization and geospatial workflows.",
    "link": "",
    "problem_statement": "Loan recovery operations lacked centralized visibility into real-time field-agent activity and hierarchical performance metrics. Existing systems were fragmented, relied heavily on manual reporting, and did not provide timely operational insights for decision-makers.",
    "design_decisions": [
      "Designed hierarchy-driven reporting views aggregating data across regional head, state head, manager, and field-officer levels",
      "Built real-time field activity monitoring dashboards with live status, visit timelines, and location tracking",
      "Integrated external services including Frappe APIs, Google Maps, and OpenStreetMap for geospatial data and operational workflows",
      "Implemented map-based visualizations to correlate agent movement, visits, and collections",
      "Optimized frontend data handling for large datasets with filters, exports, and role-specific views",
      "Balanced near-real-time updates with performance considerations to avoid excessive API load"
    ],
    "impact_metrics": [
      "Enabled real-time visibility into field-agent activity and operational status across regions",
      "Improved decision-making for managers and leadership through hierarchy-based performance reporting",
      "Reduced dependency on manual status tracking and ad-hoc reports",
      "Supported daily monitoring of large field teams in loan recovery operations"
    ],
    "attachments": [
      {
        "url": "fintech/fintech-main-dashboard.jpeg",
        "caption": "Main Operational Dashboard",
        "alt": "Comprehensive dashboard showing high-level operational metrics and KPIs"
      },
      {
        "url": "fintech/fintech-field-dashboard.jpeg",
        "caption": "Field Operations Dashboard",
        "alt": "Dashboard focused on field agent activities and daily targets"
      },
      {
        "url": "fintech/fintech-field-user-tracking.jpeg",
        "caption": "Real-Time Agent Tracking",
        "alt": "Map view displaying real-time locations of field agents"
      },
      {
        "url": "fintech/fintech-field-user-tracking-2.jpeg",
        "caption": "Agent Route Analysis",
        "alt": "Detailed view of agent routes and movement history"
      },
      {
        "url": "fintech/fintech-field-user-nearby-parties.jpeg",
        "caption": "Geospatial Party Locating",
        "alt": "Map interface for locating nearby parties or customers for visits"
      },
      {
        "url": "fintech/fintech-field-user-street-view.jpeg",
        "caption": "Street View Verification",
        "alt": "Integrated street view for verifying location details"
      },
      {
        "url": "fintech/fintech-field-recursive-table.jpeg",
        "caption": "Hierarchical Data Reporting",
        "alt": "Table view showing recursive hierarchy of data for reporting"
      }
    ]
  },
  {
    "id": 5,
    "title": "PRODUCTION ADMIN PLATFORM REFACTOR — FRONTEND SCALABILITY",
    "role": "Frontend Architecture & Refactoring Ownership",
    "description": "Refactored a large production admin platform at Frugal Scientific, reducing the frontend codebase from approximately 100K to 50K lines of code. Improved maintainability, readability, and long-term scalability by eliminating duplicated logic, restructuring component boundaries, and standardizing state and data-handling patterns across the application.",
    "link": "",
    "problem_statement": "The existing admin platform had grown organically with duplicated components, tightly coupled logic, and inconsistent patterns, making feature development slow, error-prone, and difficult to scale as product requirements evolved.",
    "design_decisions": [
      "Identified and eliminated duplicated UI and state-management logic across multiple admin modules",
      "Refactored large, tightly coupled components into smaller, reusable and composable units",
      "Standardized data-fetching, loading states, and error handling across the application",
      "Improved separation of concerns between UI rendering, business logic, and API integration layers",
      "Aligned the refactored structure with long-term scalability and future extensibility goals"
    ],
    "impact_metrics": [
      "Reduced frontend codebase size by ~50% without feature loss",
      "Improved developer productivity and onboarding by simplifying code structure",
      "Reduced maintenance overhead and risk of regression during feature changes",
      "Prepared the platform for future feature expansion with a cleaner architectural foundation"
    ]
  },
  {
    "id": 6,
    "title": "LOGISTICS CRM UI/UX RESTRUCTURING — ROLE-BASED DASHBOARDS",
    "role": "Frontend Architecture & UX Restructuring",
    "description": "Co-led a complete UI/UX restructuring of a large logistics CRM platform in close collaboration with the UX design team. Transformed the system from a menu-heavy, module-scattered interface into a clean, module-based, role-driven dashboard experience. Designed and implemented role-based user dashboards with clear information hierarchy to improve operational monitoring, financial visibility, and decision-making for operations, finance, and management users. Introduced consistent theming and first-class geo-data representation using maps to better align the interface with real-world logistics workflows.",
    "link": "",
    "problem_statement": "The existing logistics CRM interface had evolved organically with numerous side menus and fragmented internal modules, resulting in poor UX, high cognitive load, and limited visibility into operational and financial data. Users struggled to monitor workflows and derive insights efficiently from the system.",
    "design_decisions": [
      "Collaborated closely with the UX design team to redefine information hierarchy and dashboard layouts",
      "Replaced menu-heavy navigation with module-based, role-specific dashboards",
      "Designed role-based views to surface operational, financial, and performance metrics relevant to each user persona",
      "Introduced consistent theming and layout standards to improve visual coherence across modules",
      "Integrated geo-data and map-based visualizations as first-class UI elements for logistics monitoring",
      "Simplified navigation flows to reduce cognitive load for daily operational users"
    ],
    "impact_metrics": [
      "Significantly improved usability and clarity for operations and finance teams",
      "Enabled faster monitoring of logistics operations through dashboard-driven workflows",
      "Reduced user confusion caused by fragmented legacy navigation structures",
      "Established a scalable UI foundation aligned with long-term CRM evolution"
    ],
    "links": [
      {
        "label": "View design walkthrough",
        "url": ""
      }
    ],
    "attachments": [
      {
        "url": "logistics/logistics-sea-dashboard.jpeg",
        "caption": "Maritime Logistics Dashboard",
        "alt": "Comprehensive dashboard for tracking sea freight and logistics operations"
      },
      {
        "url": "logistics/logistics-wms.jpeg",
        "caption": "Warehouse Management System (WMS)",
        "alt": "Interface for managing warehouse inventory and stock levels"
      },
      {
        "url": "logistics/logistics-multi-consigment-geo-tracking.jpeg",
        "caption": "Multi-Consignment Geo Tracking",
        "alt": "Map-based tracking of multiple consignments in real-time"
      },
      {
        "url": "logistics/logistics-map-popover.jpeg",
        "caption": "Interactive Map Popover",
        "alt": "Detailed shipment information displayed on map interaction"
      },
      {
        "url": "logistics/logistics-dark-mode.jpeg",
        "caption": "Dark Mode Interface",
        "alt": "Sleek dark mode version of the logistics CRM interface"
      }
    ]
  },
  {
    "id": 7,
    "title": "LOGISTICS PLATFORM CONTRIBUTIONS — CRM & SELF-SERVICE PORTALS",
    "role": "Frontend Contributions (Enterprise Logistics Platform)",
    "description": "Contributed to multiple frontend modules of a large-scale logistics platform during the early phase at Frugal Scientific, working across both the internal CRM system and a client-facing self-service portal. Delivered UI components, screens, and workflows for customer, vendor, consignment, and contract management, along with vendor RFQ (Request for Proposal) and response workflows. Also contributed to shared utilities and operational dashboards used across logistics teams.",
    "link": "",
    "problem_statement": "The logistics platform required continuous frontend development across multiple functional areas to support customer onboarding, vendor engagement, contract handling, and RFQ workflows while maintaining consistency within an evolving enterprise system.",
    "design_decisions": [
      "Implemented frontend screens and workflows for customer, vendor, consignment, and contract management modules",
      "Contributed to vendor RFQ and response workflows supporting proposal creation, review, and status tracking",
      "Worked on shared utilities and dashboards used across multiple logistics modules",
      "Ensured consistency with existing design systems, role-based access patterns, and shared components",
      "Collaborated closely with senior engineers, product managers, and designers within a live production environment"
    ],
    "impact_metrics": [
      "Supported core logistics workflows for customer and vendor management within the CRM",
      "Enabled smoother vendor RFQ and proposal handling through improved frontend workflows",
      "Contributed to operational dashboards and utilities used by logistics teams",
      "Delivered production features safely within a complex, multi-module enterprise system"
    ],
    "links": [
      {
        "label": "View platform overview",
        "url": ""
      }
    ]
  }
]